emacs/.config/emacs/config/navigation/README.org
#+TITLE: Navigation config
#+AUTHOR: umi
#+STARTUP: overview

* Helm
** Installation

#+begin_src emacs-lisp
      (use-package helm)
#+end_src

** Git extension

#+begin_src emacs-lisp
  (use-package helm-ls-git
  :after helm)
#+end_src

** Projectile extension

#+begin_src emacs-lisp
    (use-package helm-projectile
    :after (helm projectile))
#+end_src

** Config

#+begin_src emacs-lisp
  (setq helm-move-to-line-cycle-in-source nil)
#+end_src

** Keybinds
#+begin_src emacs-lisp
  (with-eval-after-load 'helm
  (define-key helm-map (kbd "C-k") 'helm-previous-line)
  (define-key helm-map (kbd "C-j") 'helm-next-line))
#+end_src

* FILE NAVIGATION
** Keybinds

#+begin_src emacs-lisp
  (with-eval-after-load 'helm-projectile
    (with-eval-after-load 'general
  (leader-key
  "f" '(helm-projectile-find-file :wk "Find file")
  "c f" '((lambda () (interactive) (find-file "~/.config/emacs/config/README.org")) :wk "Edit emacs config"))))
#+end_src

* BUFFER NAVIGATION
** Keybinds

#+begin_src emacs-lisp
  (with-eval-after-load 'general
  (leader-key
    "b" '(:ignore t :wk "buffer")
    "bf" '(ibuffer :wk "Ibuffer")
    "bb" '(switch-to-buffer :wk "Switch buffer")
    "bk" '(kill-this-buffer :wk "Kill this buffer")
    "bn" '(next-buffer :wk "Next buffer")
    "bp" '(previous-buffer :wk "Previous buffer")
    "br" '(revert-buffer :wk "Reload buffer")))
#+end_src
